list_numbers = [2, 90, -2, 8, -36, -44, -1, -85, -14, 90, -22, -90, -100, -8, 38, -92, -45, 67, 53, 25]

max_index = 0 # Задаем начало счетчика индекса макс.элемента - индекс первого элемента
max_number = list_numbers[max_index] # Задаем начало счетчика максимального элемента с первого элемента списка через индекс. макс элемента

for current_index, current_number in enumerate(list_numbers): # Для пар текущий индекс и текущий элемент из списка
    max_number = list_numbers[max_index]
    if current_number >= max_number: # Если текущий элемент больше либо равен максимальному из тех, что встретили
        max_index = current_index # то перезаписываем индекс максимального элемента
        max_number = list_numbers[current_index] # И перезапишем максимальный элемент на данный момент

# print("Максимальный последний элемент:", max_number) # Выведем значения максимального последнего элемента -- 90
# print("Индекс максимального последнего элемента:", max_index) # и его индекса для проверки -- 9

list_numbers[max_index], list_numbers[-1] = list_numbers[-1], list_numbers[max_index] # Выполняем требуемую по условию замену

print(list_numbers)  # Ответ [2, 90, -2, 8, -36, -44, -1, -85, -14, 25, -22, -90, -100, -8, 38, -92, -45, 67, 53, 90]
