salary = 5000  # зарплата
spend = 6000  # траты
months = 10  # количество месяцев
increase = 0.03  # рост цен

money_capital = 0  # задаю счетчик подушки безопасности

# Выбираю цикл с заданным количеством шагов, т.к известно количество месяцев, т.е количество шагов цикла
for current_month in range(months): #для текущего месяца в последовательности месяцев
    delta = spend - salary # убыток
    money_capital += delta # приваиваю новое значение капитала
    spend *= 1 + increase # присваиваю новое значение трат с учетом роста цен
print(round(money_capital))
